#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Switch_Seq_V2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Switch_Seq_V2.ABP_Switch_Seq_V2_C
// 0x0320 (0x0970 - 0x0650)
class UABP_Switch_Seq_V2_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0650(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0658(0x0038)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0690(0x00B0)()
	struct FAnimNode_PoseSnapshot                 AnimGraphNode_PoseSnapshot;                        // 0x0740(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x07F0(0x0138)()
	struct FPoseSnapshot                          CachePose;                                         // 0x0928(0x0040)(Edit, BlueprintVisible)
	bool                                          EnableSwitchPose;                                  // 0x0968(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_969[0x3];                                      // 0x0969(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FalseBlendTime;                                    // 0x096C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_Switch_Seq_V2(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Switch_Seq_V2_C">();
	}
	static class UABP_Switch_Seq_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Switch_Seq_V2_C>();
	}
};
static_assert(alignof(UABP_Switch_Seq_V2_C) == 0x000010, "Wrong alignment on UABP_Switch_Seq_V2_C");
static_assert(sizeof(UABP_Switch_Seq_V2_C) == 0x000970, "Wrong size on UABP_Switch_Seq_V2_C");
static_assert(offsetof(UABP_Switch_Seq_V2_C, UberGraphFrame) == 0x000650, "Member 'UABP_Switch_Seq_V2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Switch_Seq_V2_C, AnimGraphNode_Root) == 0x000658, "Member 'UABP_Switch_Seq_V2_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Switch_Seq_V2_C, AnimGraphNode_BlendListByBool) == 0x000690, "Member 'UABP_Switch_Seq_V2_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Switch_Seq_V2_C, AnimGraphNode_PoseSnapshot) == 0x000740, "Member 'UABP_Switch_Seq_V2_C::AnimGraphNode_PoseSnapshot' has a wrong offset!");
static_assert(offsetof(UABP_Switch_Seq_V2_C, AnimGraphNode_LinkedInputPose) == 0x0007F0, "Member 'UABP_Switch_Seq_V2_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Switch_Seq_V2_C, CachePose) == 0x000928, "Member 'UABP_Switch_Seq_V2_C::CachePose' has a wrong offset!");
static_assert(offsetof(UABP_Switch_Seq_V2_C, EnableSwitchPose) == 0x000968, "Member 'UABP_Switch_Seq_V2_C::EnableSwitchPose' has a wrong offset!");
static_assert(offsetof(UABP_Switch_Seq_V2_C, FalseBlendTime) == 0x00096C, "Member 'UABP_Switch_Seq_V2_C::FalseBlendTime' has a wrong offset!");

}

