#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Base_Sword

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KuroAnim_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Base_Sword.ABP_Base_Sword_C
// 0x04E0 (0x0B30 - 0x0650)
class UABP_Base_Sword_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0650(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0658(0x0038)()
	struct FAnimNode_PhyCloth                     AnimGraphNode_PhyCloth;                            // 0x0690(0x0440)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0AD0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0AF0(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0B10(0x0018)()

public:
	void ExecuteUbergraph_ABP_Base_Sword(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Base_Sword_C">();
	}
	static class UABP_Base_Sword_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Base_Sword_C>();
	}
};
static_assert(alignof(UABP_Base_Sword_C) == 0x000010, "Wrong alignment on UABP_Base_Sword_C");
static_assert(sizeof(UABP_Base_Sword_C) == 0x000B30, "Wrong size on UABP_Base_Sword_C");
static_assert(offsetof(UABP_Base_Sword_C, UberGraphFrame) == 0x000650, "Member 'UABP_Base_Sword_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Base_Sword_C, AnimGraphNode_Root) == 0x000658, "Member 'UABP_Base_Sword_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Base_Sword_C, AnimGraphNode_PhyCloth) == 0x000690, "Member 'UABP_Base_Sword_C::AnimGraphNode_PhyCloth' has a wrong offset!");
static_assert(offsetof(UABP_Base_Sword_C, AnimGraphNode_ComponentToLocalSpace) == 0x000AD0, "Member 'UABP_Base_Sword_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Base_Sword_C, AnimGraphNode_LocalToComponentSpace) == 0x000AF0, "Member 'UABP_Base_Sword_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Base_Sword_C, AnimGraphNode_LocalRefPose) == 0x000B10, "Member 'UABP_Base_Sword_C::AnimGraphNode_LocalRefPose' has a wrong offset!");

}

