#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Performance_PlayerFemale_PC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KuroAnim_structs.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Performance_PlayerFemale_PC.ABP_Performance_PlayerFemale_PC_C
// 0x1C40 (0x2290 - 0x0650)
class UABP_Performance_PlayerFemale_PC_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0650(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0658(0x0038)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0690(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x06B0(0x0020)()
	struct FAnimNode_MountBuffer                  AnimGraphNode_MountBuffer;                         // 0x06D0(0x01D0)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_8;                // 0x08A0(0x0290)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_7;                // 0x0B30(0x0290)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_6;                // 0x0DC0(0x0290)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_5;                // 0x1050(0x0290)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_4;                // 0x12E0(0x0290)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_3;                // 0x1570(0x0290)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_2;                // 0x1800(0x0290)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_1;                // 0x1A90(0x0290)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup;                  // 0x1D20(0x0290)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1FB0(0x0138)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x20E8(0x0038)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x2120(0x00C0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x21E0(0x00A8)()

public:
	void ExecuteUbergraph_ABP_Performance_PlayerFemale_PC(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void PhyCloth(const struct FPoseLink& InPose, struct FPoseLink* Param_PhyCloth);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Performance_PlayerFemale_PC_C">();
	}
	static class UABP_Performance_PlayerFemale_PC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Performance_PlayerFemale_PC_C>();
	}
};
static_assert(alignof(UABP_Performance_PlayerFemale_PC_C) == 0x000010, "Wrong alignment on UABP_Performance_PlayerFemale_PC_C");
static_assert(sizeof(UABP_Performance_PlayerFemale_PC_C) == 0x002290, "Wrong size on UABP_Performance_PlayerFemale_PC_C");
static_assert(offsetof(UABP_Performance_PlayerFemale_PC_C, UberGraphFrame) == 0x000650, "Member 'UABP_Performance_PlayerFemale_PC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerFemale_PC_C, AnimGraphNode_Root_1) == 0x000658, "Member 'UABP_Performance_PlayerFemale_PC_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerFemale_PC_C, AnimGraphNode_LocalToComponentSpace) == 0x000690, "Member 'UABP_Performance_PlayerFemale_PC_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerFemale_PC_C, AnimGraphNode_ComponentToLocalSpace) == 0x0006B0, "Member 'UABP_Performance_PlayerFemale_PC_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerFemale_PC_C, AnimGraphNode_MountBuffer) == 0x0006D0, "Member 'UABP_Performance_PlayerFemale_PC_C::AnimGraphNode_MountBuffer' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerFemale_PC_C, AnimGraphNode_KawaiiPhysicsGroup_8) == 0x0008A0, "Member 'UABP_Performance_PlayerFemale_PC_C::AnimGraphNode_KawaiiPhysicsGroup_8' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerFemale_PC_C, AnimGraphNode_KawaiiPhysicsGroup_7) == 0x000B30, "Member 'UABP_Performance_PlayerFemale_PC_C::AnimGraphNode_KawaiiPhysicsGroup_7' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerFemale_PC_C, AnimGraphNode_KawaiiPhysicsGroup_6) == 0x000DC0, "Member 'UABP_Performance_PlayerFemale_PC_C::AnimGraphNode_KawaiiPhysicsGroup_6' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerFemale_PC_C, AnimGraphNode_KawaiiPhysicsGroup_5) == 0x001050, "Member 'UABP_Performance_PlayerFemale_PC_C::AnimGraphNode_KawaiiPhysicsGroup_5' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerFemale_PC_C, AnimGraphNode_KawaiiPhysicsGroup_4) == 0x0012E0, "Member 'UABP_Performance_PlayerFemale_PC_C::AnimGraphNode_KawaiiPhysicsGroup_4' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerFemale_PC_C, AnimGraphNode_KawaiiPhysicsGroup_3) == 0x001570, "Member 'UABP_Performance_PlayerFemale_PC_C::AnimGraphNode_KawaiiPhysicsGroup_3' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerFemale_PC_C, AnimGraphNode_KawaiiPhysicsGroup_2) == 0x001800, "Member 'UABP_Performance_PlayerFemale_PC_C::AnimGraphNode_KawaiiPhysicsGroup_2' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerFemale_PC_C, AnimGraphNode_KawaiiPhysicsGroup_1) == 0x001A90, "Member 'UABP_Performance_PlayerFemale_PC_C::AnimGraphNode_KawaiiPhysicsGroup_1' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerFemale_PC_C, AnimGraphNode_KawaiiPhysicsGroup) == 0x001D20, "Member 'UABP_Performance_PlayerFemale_PC_C::AnimGraphNode_KawaiiPhysicsGroup' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerFemale_PC_C, AnimGraphNode_LinkedInputPose) == 0x001FB0, "Member 'UABP_Performance_PlayerFemale_PC_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerFemale_PC_C, AnimGraphNode_Root) == 0x0020E8, "Member 'UABP_Performance_PlayerFemale_PC_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerFemale_PC_C, AnimGraphNode_LinkedAnimLayer) == 0x002120, "Member 'UABP_Performance_PlayerFemale_PC_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerFemale_PC_C, AnimGraphNode_LinkedAnimGraph) == 0x0021E0, "Member 'UABP_Performance_PlayerFemale_PC_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");

}

