#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIC_AICommon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ECharacterState_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SAiConditions_structs.hpp"
#include "TsAiController_classes.hpp"
#include "EAiLevelVarSource_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass AIC_AICommon.AIC_AICommon_C
// 0x03B0 (0x0788 - 0x03D8)
class AAIC_AICommon_C final : public ATsAiController_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AIC_AICommon_C;                     // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ATsBaseCharacter_C*                     Stari___a;                                         // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          __Mn;                                              // 0x03E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSAiConditions                         L___LMna_;                                         // 0x0400(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSAiConditions                         ______;                                            // 0x04B8(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSAiConditions                         __L__Mn;                                           // 0x0570(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class AActor*>                         _h___ap_;                                          // 0x0628(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AActor*>                         _h_d_ap_;                                          // 0x0638(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         SM_h_hp_;                                          // 0x0648(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64C[0x4];                                      // 0x064C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         _____ap_;                                          // 0x0650(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AActor*>                         ___d_ap_;                                          // 0x0660(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         SM___hp_;                                          // 0x0670(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_674[0x4];                                      // 0x0674(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         _h_____;                                           // 0x0678(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AActor*>                         _h____d;                                           // 0x0688(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         _h__ap_;                                           // 0x0698(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stari__;                                           // 0x069C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSAiConditions                         E___1;                                             // 0x06A0(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class AActor*>                         _____ap__0;                                        // 0x0758(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class AActor*                                 SM_h_a;                                            // 0x0768(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UKuroRegionDetectComponent*             ____;                                              // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ___S_;                                             // 0x0778(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AIC_AICommon(int32 EntryPoint);
	void Func________0(bool bContent);
	void Func_______();
	void E___(bool bContent);
	void AicTriggerEvent(class FName Param_Name);
	void _h___(const TArray<class AActor*>& AddActor, const TArray<class AActor*>& RemoveActor, const TArray<int32>& RemoveActorIds, int32 Num);
	void Func______0(const TArray<class AActor*>& AddActor, const TArray<class AActor*>& RemoveActor, const TArray<int32>& RemoveActorIds, int32 Num);
	void _h__(const TArray<class AActor*>& AddActor, const TArray<class AActor*>& RemoveActor, const TArray<int32>& RemoveActorIds, int32 Num);
	void ____AI(bool bContent);
	void ________(bool bContent);
	void __L__a_(bool bContent);
	void ReceiveTick(float DeltaSeconds);
	void ___b_p(class UObject* _r, ECharacterState ___, ECharacterState ____0, bool Param___, class UObject** _r__, ECharacterState* _____, ECharacterState* ______0, bool* Param_____);
	void __0_h__();
	void _n_____a();
	void __(const TDelegate<void()>& b___);
	void _______p(const class FString& Param_____, const TDelegate<void(bool IsInRegion, class AActor* Target)>& __);
	void _rStar___K(bool* Param_____);
	void __sa___b__(EAiLevelVarSource Sa______, const class FString& Sa____, int32 Sao_L__id, const TDelegate<void(bool bContent)>& __);
	void OnStart();
	void ___b_(ECharacterState OldState, ECharacterState NewState, bool Param_IsAutonomousProxy);
	void ___6C_();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AIC_AICommon_C">();
	}
	static class AAIC_AICommon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAIC_AICommon_C>();
	}
};
static_assert(alignof(AAIC_AICommon_C) == 0x000008, "Wrong alignment on AAIC_AICommon_C");
static_assert(sizeof(AAIC_AICommon_C) == 0x000788, "Wrong size on AAIC_AICommon_C");
static_assert(offsetof(AAIC_AICommon_C, UberGraphFrame_AIC_AICommon_C) == 0x0003D8, "Member 'AAIC_AICommon_C::UberGraphFrame_AIC_AICommon_C' has a wrong offset!");
static_assert(offsetof(AAIC_AICommon_C, Stari___a) == 0x0003E0, "Member 'AAIC_AICommon_C::Stari___a' has a wrong offset!");
static_assert(offsetof(AAIC_AICommon_C, __Mn) == 0x0003E8, "Member 'AAIC_AICommon_C::__Mn' has a wrong offset!");
static_assert(offsetof(AAIC_AICommon_C, L___LMna_) == 0x000400, "Member 'AAIC_AICommon_C::L___LMna_' has a wrong offset!");
static_assert(offsetof(AAIC_AICommon_C, ______) == 0x0004B8, "Member 'AAIC_AICommon_C::______' has a wrong offset!");
static_assert(offsetof(AAIC_AICommon_C, __L__Mn) == 0x000570, "Member 'AAIC_AICommon_C::__L__Mn' has a wrong offset!");
static_assert(offsetof(AAIC_AICommon_C, _h___ap_) == 0x000628, "Member 'AAIC_AICommon_C::_h___ap_' has a wrong offset!");
static_assert(offsetof(AAIC_AICommon_C, _h_d_ap_) == 0x000638, "Member 'AAIC_AICommon_C::_h_d_ap_' has a wrong offset!");
static_assert(offsetof(AAIC_AICommon_C, SM_h_hp_) == 0x000648, "Member 'AAIC_AICommon_C::SM_h_hp_' has a wrong offset!");
static_assert(offsetof(AAIC_AICommon_C, _____ap_) == 0x000650, "Member 'AAIC_AICommon_C::_____ap_' has a wrong offset!");
static_assert(offsetof(AAIC_AICommon_C, ___d_ap_) == 0x000660, "Member 'AAIC_AICommon_C::___d_ap_' has a wrong offset!");
static_assert(offsetof(AAIC_AICommon_C, SM___hp_) == 0x000670, "Member 'AAIC_AICommon_C::SM___hp_' has a wrong offset!");
static_assert(offsetof(AAIC_AICommon_C, _h_____) == 0x000678, "Member 'AAIC_AICommon_C::_h_____' has a wrong offset!");
static_assert(offsetof(AAIC_AICommon_C, _h____d) == 0x000688, "Member 'AAIC_AICommon_C::_h____d' has a wrong offset!");
static_assert(offsetof(AAIC_AICommon_C, _h__ap_) == 0x000698, "Member 'AAIC_AICommon_C::_h__ap_' has a wrong offset!");
static_assert(offsetof(AAIC_AICommon_C, Stari__) == 0x00069C, "Member 'AAIC_AICommon_C::Stari__' has a wrong offset!");
static_assert(offsetof(AAIC_AICommon_C, E___1) == 0x0006A0, "Member 'AAIC_AICommon_C::E___1' has a wrong offset!");
static_assert(offsetof(AAIC_AICommon_C, _____ap__0) == 0x000758, "Member 'AAIC_AICommon_C::_____ap__0' has a wrong offset!");
static_assert(offsetof(AAIC_AICommon_C, SM_h_a) == 0x000768, "Member 'AAIC_AICommon_C::SM_h_a' has a wrong offset!");
static_assert(offsetof(AAIC_AICommon_C, ____) == 0x000770, "Member 'AAIC_AICommon_C::____' has a wrong offset!");
static_assert(offsetof(AAIC_AICommon_C, ___S_) == 0x000778, "Member 'AAIC_AICommon_C::___S_' has a wrong offset!");

}

