#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Cloud_LaunchScene

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Cloud_LaunchScene.BP_Cloud_LaunchScene_C
// 0x0020 (0x02D0 - 0x02B0)
class ABP_Cloud_LaunchScene_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   Cloud;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPD_CloudPrefab_C*                      CloudPrefeb;                                       // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Cloud_LaunchScene(int32 EntryPoint);
	void Init();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Cloud_LaunchScene_C">();
	}
	static class ABP_Cloud_LaunchScene_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Cloud_LaunchScene_C>();
	}
};
static_assert(alignof(ABP_Cloud_LaunchScene_C) == 0x000008, "Wrong alignment on ABP_Cloud_LaunchScene_C");
static_assert(sizeof(ABP_Cloud_LaunchScene_C) == 0x0002D0, "Wrong size on ABP_Cloud_LaunchScene_C");
static_assert(offsetof(ABP_Cloud_LaunchScene_C, UberGraphFrame) == 0x0002B0, "Member 'ABP_Cloud_LaunchScene_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Cloud_LaunchScene_C, Cloud) == 0x0002B8, "Member 'ABP_Cloud_LaunchScene_C::Cloud' has a wrong offset!");
static_assert(offsetof(ABP_Cloud_LaunchScene_C, DefaultSceneRoot) == 0x0002C0, "Member 'ABP_Cloud_LaunchScene_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Cloud_LaunchScene_C, CloudPrefeb) == 0x0002C8, "Member 'ABP_Cloud_LaunchScene_C::CloudPrefeb' has a wrong offset!");

}

