#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GongduolaConfig

#include "Basic.hpp"

#include "BP_VehicleConfig_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GongduolaConfig.BP_GongduolaConfig_C
// 0x00E0 (0x01B8 - 0x00D8)
class UBP_GongduolaConfig_C final : public UBP_VehicleConfig_C
{
public:
	float                                         M_______;                                          // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Eight_________;                                    // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Eight_M____;                                       // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Eight______;                                       // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Eight_9f___;                                       // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Eight_______0;                                     // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Eight___l____;                                     // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Eight___l_____0;                                   // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Eight_l_l____c_p;                                  // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Eight_l_l____c_p_0;                                // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Eight_l_l____c_p_1;                                // 0x0100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Eight_____i__;                                     // 0x0104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Eight_Star___i__;                                  // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Eight___l___;                                      // 0x010C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Eight_l_i___p;                                     // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Eight_l_Ybi__;                                     // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___P____;                                          // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___P_____0;                                        // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ________;                                          // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __________;                                        // 0x0124(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___b__;                                            // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __M____;                                           // 0x012C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __9f___;                                           // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______;                                           // 0x0134(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ________0;                                         // 0x0138(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____l____;                                         // 0x013C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____l_____0;                                       // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __l_l____c_p;                                      // 0x0144(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __l_l____c_p_0;                                    // 0x0148(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __l_l____c_p_1;                                    // 0x014C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ______i__;                                         // 0x0150(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __Star___i__;                                      // 0x0154(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____l___;                                          // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __l_i___p;                                         // 0x015C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __l_Ybi__;                                         // 0x0160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __________i__;                                     // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____M__e__;                                        // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___n__;                                            // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         N_saMn;                                            // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _EMn;                                              // 0x0174(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _n___p;                                            // 0x0178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L___;                                              // 0x017C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ______p;                                           // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _l____p;                                           // 0x0184(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Eight_l__6M__e_p;                                  // 0x0188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __l__6M__e_p;                                      // 0x018C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Eight___M__e__;                                    // 0x0190(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Eight______e__;                                    // 0x0194(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____M__e___0;                                      // 0x0198(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______e__;                                        // 0x019C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ______;                                            // 0x01A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___t__;                                            // 0x01A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _______p;                                          // 0x01A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __X_e;                                             // 0x01AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __l___X_e;                                         // 0x01B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GongduolaConfig_C">();
	}
	static class UBP_GongduolaConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GongduolaConfig_C>();
	}
};
static_assert(alignof(UBP_GongduolaConfig_C) == 0x000008, "Wrong alignment on UBP_GongduolaConfig_C");
static_assert(sizeof(UBP_GongduolaConfig_C) == 0x0001B8, "Wrong size on UBP_GongduolaConfig_C");
static_assert(offsetof(UBP_GongduolaConfig_C, M_______) == 0x0000D8, "Member 'UBP_GongduolaConfig_C::M_______' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, Eight_________) == 0x0000DC, "Member 'UBP_GongduolaConfig_C::Eight_________' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, Eight_M____) == 0x0000E0, "Member 'UBP_GongduolaConfig_C::Eight_M____' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, Eight______) == 0x0000E4, "Member 'UBP_GongduolaConfig_C::Eight______' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, Eight_9f___) == 0x0000E8, "Member 'UBP_GongduolaConfig_C::Eight_9f___' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, Eight_______0) == 0x0000EC, "Member 'UBP_GongduolaConfig_C::Eight_______0' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, Eight___l____) == 0x0000F0, "Member 'UBP_GongduolaConfig_C::Eight___l____' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, Eight___l_____0) == 0x0000F4, "Member 'UBP_GongduolaConfig_C::Eight___l_____0' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, Eight_l_l____c_p) == 0x0000F8, "Member 'UBP_GongduolaConfig_C::Eight_l_l____c_p' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, Eight_l_l____c_p_0) == 0x0000FC, "Member 'UBP_GongduolaConfig_C::Eight_l_l____c_p_0' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, Eight_l_l____c_p_1) == 0x000100, "Member 'UBP_GongduolaConfig_C::Eight_l_l____c_p_1' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, Eight_____i__) == 0x000104, "Member 'UBP_GongduolaConfig_C::Eight_____i__' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, Eight_Star___i__) == 0x000108, "Member 'UBP_GongduolaConfig_C::Eight_Star___i__' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, Eight___l___) == 0x00010C, "Member 'UBP_GongduolaConfig_C::Eight___l___' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, Eight_l_i___p) == 0x000110, "Member 'UBP_GongduolaConfig_C::Eight_l_i___p' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, Eight_l_Ybi__) == 0x000114, "Member 'UBP_GongduolaConfig_C::Eight_l_Ybi__' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, ___P____) == 0x000118, "Member 'UBP_GongduolaConfig_C::___P____' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, ___P_____0) == 0x00011C, "Member 'UBP_GongduolaConfig_C::___P_____0' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, ________) == 0x000120, "Member 'UBP_GongduolaConfig_C::________' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, __________) == 0x000124, "Member 'UBP_GongduolaConfig_C::__________' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, ___b__) == 0x000128, "Member 'UBP_GongduolaConfig_C::___b__' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, __M____) == 0x00012C, "Member 'UBP_GongduolaConfig_C::__M____' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, __9f___) == 0x000130, "Member 'UBP_GongduolaConfig_C::__9f___' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, _______) == 0x000134, "Member 'UBP_GongduolaConfig_C::_______' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, ________0) == 0x000138, "Member 'UBP_GongduolaConfig_C::________0' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, ____l____) == 0x00013C, "Member 'UBP_GongduolaConfig_C::____l____' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, ____l_____0) == 0x000140, "Member 'UBP_GongduolaConfig_C::____l_____0' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, __l_l____c_p) == 0x000144, "Member 'UBP_GongduolaConfig_C::__l_l____c_p' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, __l_l____c_p_0) == 0x000148, "Member 'UBP_GongduolaConfig_C::__l_l____c_p_0' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, __l_l____c_p_1) == 0x00014C, "Member 'UBP_GongduolaConfig_C::__l_l____c_p_1' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, ______i__) == 0x000150, "Member 'UBP_GongduolaConfig_C::______i__' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, __Star___i__) == 0x000154, "Member 'UBP_GongduolaConfig_C::__Star___i__' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, ____l___) == 0x000158, "Member 'UBP_GongduolaConfig_C::____l___' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, __l_i___p) == 0x00015C, "Member 'UBP_GongduolaConfig_C::__l_i___p' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, __l_Ybi__) == 0x000160, "Member 'UBP_GongduolaConfig_C::__l_Ybi__' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, __________i__) == 0x000164, "Member 'UBP_GongduolaConfig_C::__________i__' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, ____M__e__) == 0x000168, "Member 'UBP_GongduolaConfig_C::____M__e__' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, ___n__) == 0x00016C, "Member 'UBP_GongduolaConfig_C::___n__' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, N_saMn) == 0x000170, "Member 'UBP_GongduolaConfig_C::N_saMn' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, _EMn) == 0x000174, "Member 'UBP_GongduolaConfig_C::_EMn' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, _n___p) == 0x000178, "Member 'UBP_GongduolaConfig_C::_n___p' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, L___) == 0x00017C, "Member 'UBP_GongduolaConfig_C::L___' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, ______p) == 0x000180, "Member 'UBP_GongduolaConfig_C::______p' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, _l____p) == 0x000184, "Member 'UBP_GongduolaConfig_C::_l____p' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, Eight_l__6M__e_p) == 0x000188, "Member 'UBP_GongduolaConfig_C::Eight_l__6M__e_p' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, __l__6M__e_p) == 0x00018C, "Member 'UBP_GongduolaConfig_C::__l__6M__e_p' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, Eight___M__e__) == 0x000190, "Member 'UBP_GongduolaConfig_C::Eight___M__e__' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, Eight______e__) == 0x000194, "Member 'UBP_GongduolaConfig_C::Eight______e__' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, ____M__e___0) == 0x000198, "Member 'UBP_GongduolaConfig_C::____M__e___0' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, _______e__) == 0x00019C, "Member 'UBP_GongduolaConfig_C::_______e__' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, ______) == 0x0001A0, "Member 'UBP_GongduolaConfig_C::______' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, ___t__) == 0x0001A4, "Member 'UBP_GongduolaConfig_C::___t__' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, _______p) == 0x0001A8, "Member 'UBP_GongduolaConfig_C::_______p' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, __X_e) == 0x0001AC, "Member 'UBP_GongduolaConfig_C::__X_e' has a wrong offset!");
static_assert(offsetof(UBP_GongduolaConfig_C, __l___X_e) == 0x0001B0, "Member 'UBP_GongduolaConfig_C::__l___X_e' has a wrong offset!");

}

