#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Nanzhu

#include "Basic.hpp"

#include "TsBaseCharacter_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Nanzhu.BP_Nanzhu_C
// 0x0030 (0x0780 - 0x0750)
class ABP_Nanzhu_C final : public ATsBaseCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Nanzhu_C;                        // 0x0750(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UKuroAdjustableCapsuleComponent*        Bip001LThighTwist;                                 // 0x0758(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UKuroAdjustableCapsuleComponent*        Bip001RThighTwist;                                 // 0x0760(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UKuroAdjustableCapsuleComponent*        Bip001Spine2;                                      // 0x0768(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 WeaponCase1;                                       // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 WeaponCase0;                                       // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Nanzhu(int32 EntryPoint);
	void ReceiveBeginPlay();
	void FightCommand(bool IsInAir);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Nanzhu_C">();
	}
	static class ABP_Nanzhu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Nanzhu_C>();
	}
};
static_assert(alignof(ABP_Nanzhu_C) == 0x000010, "Wrong alignment on ABP_Nanzhu_C");
static_assert(sizeof(ABP_Nanzhu_C) == 0x000780, "Wrong size on ABP_Nanzhu_C");
static_assert(offsetof(ABP_Nanzhu_C, UberGraphFrame_BP_Nanzhu_C) == 0x000750, "Member 'ABP_Nanzhu_C::UberGraphFrame_BP_Nanzhu_C' has a wrong offset!");
static_assert(offsetof(ABP_Nanzhu_C, Bip001LThighTwist) == 0x000758, "Member 'ABP_Nanzhu_C::Bip001LThighTwist' has a wrong offset!");
static_assert(offsetof(ABP_Nanzhu_C, Bip001RThighTwist) == 0x000760, "Member 'ABP_Nanzhu_C::Bip001RThighTwist' has a wrong offset!");
static_assert(offsetof(ABP_Nanzhu_C, Bip001Spine2) == 0x000768, "Member 'ABP_Nanzhu_C::Bip001Spine2' has a wrong offset!");
static_assert(offsetof(ABP_Nanzhu_C, WeaponCase1) == 0x000770, "Member 'ABP_Nanzhu_C::WeaponCase1' has a wrong offset!");
static_assert(offsetof(ABP_Nanzhu_C, WeaponCase0) == 0x000778, "Member 'ABP_Nanzhu_C::WeaponCase0' has a wrong offset!");

}

