#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SoarConfig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SoarConfig.BP_SoarConfig_C
// 0x00A8 (0x00E0 - 0x0038)
class UBP_SoarConfig_C final : public UPrimaryDataAsset
{
public:
	float                                         __b___P___;                                        // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __b___P____0;                                      // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Z___b_p___;                                        // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Z___b_p____0;                                      // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __b________;                                       // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __G_e_sa____;                                      // 0x004C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __G_e____;                                         // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Sa______;                                          // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Sa_______0;                                        // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Sa__________;                                      // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____;                                              // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___G_esa___;                                       // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _____0;                                            // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __bl______;                                        // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __bl_______0;                                      // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         b_l______;                                         // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         b_l_______0;                                       // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __b_________0;                                     // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __b____;                                           // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __b_____0;                                         // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __e___bl_;                                         // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Z___;                                              // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _____1;                                            // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Boost__bl______;                                   // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Boost__bl_______0;                                 // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Boost___;                                          // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _____;                                             // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ______;                                            // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _S____;                                            // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _S_____;                                           // 0x00B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _S_e__Ol;                                          // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _SMinus__________;                                 // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _SMinus___________0;                               // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _SMinus_______;                                    // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _SMinus________0;                                  // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _S__eb__c__;                                       // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _S__eb__c___0;                                     // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _Sl______;                                         // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugDraw;                                         // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SoarConfig_C">();
	}
	static class UBP_SoarConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SoarConfig_C>();
	}
};
static_assert(alignof(UBP_SoarConfig_C) == 0x000008, "Wrong alignment on UBP_SoarConfig_C");
static_assert(sizeof(UBP_SoarConfig_C) == 0x0000E0, "Wrong size on UBP_SoarConfig_C");
static_assert(offsetof(UBP_SoarConfig_C, __b___P___) == 0x000038, "Member 'UBP_SoarConfig_C::__b___P___' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, __b___P____0) == 0x00003C, "Member 'UBP_SoarConfig_C::__b___P____0' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, Z___b_p___) == 0x000040, "Member 'UBP_SoarConfig_C::Z___b_p___' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, Z___b_p____0) == 0x000044, "Member 'UBP_SoarConfig_C::Z___b_p____0' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, __b________) == 0x000048, "Member 'UBP_SoarConfig_C::__b________' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, __G_e_sa____) == 0x00004C, "Member 'UBP_SoarConfig_C::__G_e_sa____' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, __G_e____) == 0x000058, "Member 'UBP_SoarConfig_C::__G_e____' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, Sa______) == 0x00005C, "Member 'UBP_SoarConfig_C::Sa______' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, Sa_______0) == 0x000060, "Member 'UBP_SoarConfig_C::Sa_______0' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, Sa__________) == 0x000064, "Member 'UBP_SoarConfig_C::Sa__________' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, ____) == 0x000068, "Member 'UBP_SoarConfig_C::____' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, ___G_esa___) == 0x00006C, "Member 'UBP_SoarConfig_C::___G_esa___' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, _____0) == 0x000070, "Member 'UBP_SoarConfig_C::_____0' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, __bl______) == 0x000074, "Member 'UBP_SoarConfig_C::__bl______' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, __bl_______0) == 0x000078, "Member 'UBP_SoarConfig_C::__bl_______0' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, b_l______) == 0x00007C, "Member 'UBP_SoarConfig_C::b_l______' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, b_l_______0) == 0x000080, "Member 'UBP_SoarConfig_C::b_l_______0' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, __b_________0) == 0x000084, "Member 'UBP_SoarConfig_C::__b_________0' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, __b____) == 0x000088, "Member 'UBP_SoarConfig_C::__b____' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, __b_____0) == 0x00008C, "Member 'UBP_SoarConfig_C::__b_____0' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, __e___bl_) == 0x000090, "Member 'UBP_SoarConfig_C::__e___bl_' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, Z___) == 0x000094, "Member 'UBP_SoarConfig_C::Z___' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, _____1) == 0x000098, "Member 'UBP_SoarConfig_C::_____1' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, Boost__bl______) == 0x00009C, "Member 'UBP_SoarConfig_C::Boost__bl______' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, Boost__bl_______0) == 0x0000A0, "Member 'UBP_SoarConfig_C::Boost__bl_______0' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, Boost___) == 0x0000A4, "Member 'UBP_SoarConfig_C::Boost___' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, _____) == 0x0000A8, "Member 'UBP_SoarConfig_C::_____' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, ______) == 0x0000AC, "Member 'UBP_SoarConfig_C::______' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, _S____) == 0x0000B0, "Member 'UBP_SoarConfig_C::_S____' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, _S_____) == 0x0000B4, "Member 'UBP_SoarConfig_C::_S_____' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, _S_e__Ol) == 0x0000B8, "Member 'UBP_SoarConfig_C::_S_e__Ol' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, _SMinus__________) == 0x0000BC, "Member 'UBP_SoarConfig_C::_SMinus__________' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, _SMinus___________0) == 0x0000C0, "Member 'UBP_SoarConfig_C::_SMinus___________0' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, _SMinus_______) == 0x0000C4, "Member 'UBP_SoarConfig_C::_SMinus_______' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, _SMinus________0) == 0x0000C8, "Member 'UBP_SoarConfig_C::_SMinus________0' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, _S__eb__c__) == 0x0000CC, "Member 'UBP_SoarConfig_C::_S__eb__c__' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, _S__eb__c___0) == 0x0000D0, "Member 'UBP_SoarConfig_C::_S__eb__c___0' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, _Sl______) == 0x0000D4, "Member 'UBP_SoarConfig_C::_Sl______' has a wrong offset!");
static_assert(offsetof(UBP_SoarConfig_C, DebugDraw) == 0x0000D8, "Member 'UBP_SoarConfig_C::DebugDraw' has a wrong offset!");

}

