#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SBatchBulletPositionCircle

#include "Basic.hpp"

#include "EBatchBulletBeginRotator_structs.hpp"


namespace SDK
{

// UserDefinedStruct SBatchBulletPositionCircle.SBatchBulletPositionCircle
// 0x0050 (0x0050 - 0x0000)
struct FSBatchBulletPositionCircle final
{
public:
	class FString                                 CenterKey_10_414F109844F24506D2A77DB523DEFF98;     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 RadiusKey_11_A3D62886496D701E6EDB1F8731869F0E;     // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ForwardKey_12_4CB73B0649C7D26DF232139533F39BFD;    // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Clockwise_7_746BE9AD46637445AEEAB79208DFCCAD;      // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BeginAngle_18_DD73EE2847AFFC418086A1B216AAED35;    // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 AngleIntervalKey_14_7556E69F40FA8934B9AE2FA72C54A1DE; // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	EBatchBulletBeginRotator                      BeginRotator_21_1E03CBAD4467E7633AACE783A27D165A;  // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSBatchBulletPositionCircle) == 0x000008, "Wrong alignment on FSBatchBulletPositionCircle");
static_assert(sizeof(FSBatchBulletPositionCircle) == 0x000050, "Wrong size on FSBatchBulletPositionCircle");
static_assert(offsetof(FSBatchBulletPositionCircle, CenterKey_10_414F109844F24506D2A77DB523DEFF98) == 0x000000, "Member 'FSBatchBulletPositionCircle::CenterKey_10_414F109844F24506D2A77DB523DEFF98' has a wrong offset!");
static_assert(offsetof(FSBatchBulletPositionCircle, RadiusKey_11_A3D62886496D701E6EDB1F8731869F0E) == 0x000010, "Member 'FSBatchBulletPositionCircle::RadiusKey_11_A3D62886496D701E6EDB1F8731869F0E' has a wrong offset!");
static_assert(offsetof(FSBatchBulletPositionCircle, ForwardKey_12_4CB73B0649C7D26DF232139533F39BFD) == 0x000020, "Member 'FSBatchBulletPositionCircle::ForwardKey_12_4CB73B0649C7D26DF232139533F39BFD' has a wrong offset!");
static_assert(offsetof(FSBatchBulletPositionCircle, Clockwise_7_746BE9AD46637445AEEAB79208DFCCAD) == 0x000030, "Member 'FSBatchBulletPositionCircle::Clockwise_7_746BE9AD46637445AEEAB79208DFCCAD' has a wrong offset!");
static_assert(offsetof(FSBatchBulletPositionCircle, BeginAngle_18_DD73EE2847AFFC418086A1B216AAED35) == 0x000034, "Member 'FSBatchBulletPositionCircle::BeginAngle_18_DD73EE2847AFFC418086A1B216AAED35' has a wrong offset!");
static_assert(offsetof(FSBatchBulletPositionCircle, AngleIntervalKey_14_7556E69F40FA8934B9AE2FA72C54A1DE) == 0x000038, "Member 'FSBatchBulletPositionCircle::AngleIntervalKey_14_7556E69F40FA8934B9AE2FA72C54A1DE' has a wrong offset!");
static_assert(offsetof(FSBatchBulletPositionCircle, BeginRotator_21_1E03CBAD4467E7633AACE783A27D165A) == 0x000048, "Member 'FSBatchBulletPositionCircle::BeginRotator_21_1E03CBAD4467E7633AACE783A27D165A' has a wrong offset!");

}

