#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SBatchBulletPositionPointMatrix

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EBatchBulletBeginRotator_structs.hpp"


namespace SDK
{

// UserDefinedStruct SBatchBulletPositionPointMatrix.SBatchBulletPositionPointMatrix
// 0x0048 (0x0048 - 0x0000)
struct FSBatchBulletPositionPointMatrix final
{
public:
	TArray<struct FVector>                        PositionOffset_16_AE83FC064CB140B7885514B17DFD2433; // 0x0000(0x0010)(Edit, BlueprintVisible)
	class FString                                 CenterKey_11_0EBDAB0044D48B63198755957352880B;     // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 RotatorKey_12_E15DBC0F4B0D33F3EAC796A4EDC58363;    // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	float                                         PositionOffsetScale_13_38748F9E42DA14E959B7E7A4EFD90F98; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RotatorOffset_17_02F89344459DE0128249D897DD8AF00C; // 0x0034(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EBatchBulletBeginRotator                      BeginRotator_20_510E772541909505754D89816DA44739;  // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSBatchBulletPositionPointMatrix) == 0x000008, "Wrong alignment on FSBatchBulletPositionPointMatrix");
static_assert(sizeof(FSBatchBulletPositionPointMatrix) == 0x000048, "Wrong size on FSBatchBulletPositionPointMatrix");
static_assert(offsetof(FSBatchBulletPositionPointMatrix, PositionOffset_16_AE83FC064CB140B7885514B17DFD2433) == 0x000000, "Member 'FSBatchBulletPositionPointMatrix::PositionOffset_16_AE83FC064CB140B7885514B17DFD2433' has a wrong offset!");
static_assert(offsetof(FSBatchBulletPositionPointMatrix, CenterKey_11_0EBDAB0044D48B63198755957352880B) == 0x000010, "Member 'FSBatchBulletPositionPointMatrix::CenterKey_11_0EBDAB0044D48B63198755957352880B' has a wrong offset!");
static_assert(offsetof(FSBatchBulletPositionPointMatrix, RotatorKey_12_E15DBC0F4B0D33F3EAC796A4EDC58363) == 0x000020, "Member 'FSBatchBulletPositionPointMatrix::RotatorKey_12_E15DBC0F4B0D33F3EAC796A4EDC58363' has a wrong offset!");
static_assert(offsetof(FSBatchBulletPositionPointMatrix, PositionOffsetScale_13_38748F9E42DA14E959B7E7A4EFD90F98) == 0x000030, "Member 'FSBatchBulletPositionPointMatrix::PositionOffsetScale_13_38748F9E42DA14E959B7E7A4EFD90F98' has a wrong offset!");
static_assert(offsetof(FSBatchBulletPositionPointMatrix, RotatorOffset_17_02F89344459DE0128249D897DD8AF00C) == 0x000034, "Member 'FSBatchBulletPositionPointMatrix::RotatorOffset_17_02F89344459DE0128249D897DD8AF00C' has a wrong offset!");
static_assert(offsetof(FSBatchBulletPositionPointMatrix, BeginRotator_20_510E772541909505754D89816DA44739) == 0x000040, "Member 'FSBatchBulletPositionPointMatrix::BeginRotator_20_510E772541909505754D89816DA44739' has a wrong offset!");

}

