#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsHotPatchPanelConfig

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SHotPatchGamepad_structs.hpp"
#include "LGUI_classes.hpp"


namespace SDK
{

// TypeScriptGeneratedClass TsHotPatchPanelConfig.TsHotPatchPanelConfig_C
// 0x00A8 (0x01A8 - 0x0100)
class UTsHotPatchPanelConfig_C final : public ULGUIBehaviour
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0100(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<class AActor*, class FString>            AxisMap;                                           // 0x0108(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TMap<class AActor*, struct FSHotPatchGamepad> ActionMap;                                         // 0x0158(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, ContainsInstancedReference)

public:
	void ExecuteUbergraph_TsHotPatchPanelConfig(int32 EntryPoint);
	void OnDisableBP();
	void OnEnableBP();
	void AwakeBP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TsHotPatchPanelConfig_C">();
	}
	static class UTsHotPatchPanelConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTsHotPatchPanelConfig_C>();
	}
};
static_assert(alignof(UTsHotPatchPanelConfig_C) == 0x000008, "Wrong alignment on UTsHotPatchPanelConfig_C");
static_assert(sizeof(UTsHotPatchPanelConfig_C) == 0x0001A8, "Wrong size on UTsHotPatchPanelConfig_C");
static_assert(offsetof(UTsHotPatchPanelConfig_C, UberGraphFrame) == 0x000100, "Member 'UTsHotPatchPanelConfig_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTsHotPatchPanelConfig_C, AxisMap) == 0x000108, "Member 'UTsHotPatchPanelConfig_C::AxisMap' has a wrong offset!");
static_assert(offsetof(UTsHotPatchPanelConfig_C, ActionMap) == 0x000158, "Member 'UTsHotPatchPanelConfig_C::ActionMap' has a wrong offset!");

}

