#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsVehicleBlueprintFunctionLibrary

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TsVehicleBlueprintFunctionLibrary.TsVehicleBlueprintFunctionLibrary_C.UpdateVehiclePerformData
// 0x0018 (0x0018 - 0x0000)
struct TsVehicleBlueprintFunctionLibrary_C_UpdateVehiclePerformData final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsImpacted;                                        // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Direction;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Strength;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsVehicleBlueprintFunctionLibrary_C_UpdateVehiclePerformData) == 0x000008, "Wrong alignment on TsVehicleBlueprintFunctionLibrary_C_UpdateVehiclePerformData");
static_assert(sizeof(TsVehicleBlueprintFunctionLibrary_C_UpdateVehiclePerformData) == 0x000018, "Wrong size on TsVehicleBlueprintFunctionLibrary_C_UpdateVehiclePerformData");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_UpdateVehiclePerformData, EntityId) == 0x000000, "Member 'TsVehicleBlueprintFunctionLibrary_C_UpdateVehiclePerformData::EntityId' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_UpdateVehiclePerformData, IsImpacted) == 0x000004, "Member 'TsVehicleBlueprintFunctionLibrary_C_UpdateVehiclePerformData::IsImpacted' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_UpdateVehiclePerformData, Direction) == 0x000008, "Member 'TsVehicleBlueprintFunctionLibrary_C_UpdateVehiclePerformData::Direction' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_UpdateVehiclePerformData, Strength) == 0x00000C, "Member 'TsVehicleBlueprintFunctionLibrary_C_UpdateVehiclePerformData::Strength' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_UpdateVehiclePerformData, __WorldContext) == 0x000010, "Member 'TsVehicleBlueprintFunctionLibrary_C_UpdateVehiclePerformData::__WorldContext' has a wrong offset!");

// Function TsVehicleBlueprintFunctionLibrary.TsVehicleBlueprintFunctionLibrary_C.UpdateAnimInfo
// 0x0010 (0x0010 - 0x0000)
struct TsVehicleBlueprintFunctionLibrary_C_UpdateAnimInfo final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsVehicleBlueprintFunctionLibrary_C_UpdateAnimInfo) == 0x000008, "Wrong alignment on TsVehicleBlueprintFunctionLibrary_C_UpdateAnimInfo");
static_assert(sizeof(TsVehicleBlueprintFunctionLibrary_C_UpdateAnimInfo) == 0x000010, "Wrong size on TsVehicleBlueprintFunctionLibrary_C_UpdateAnimInfo");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_UpdateAnimInfo, EntityId) == 0x000000, "Member 'TsVehicleBlueprintFunctionLibrary_C_UpdateAnimInfo::EntityId' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_UpdateAnimInfo, __WorldContext) == 0x000008, "Member 'TsVehicleBlueprintFunctionLibrary_C_UpdateAnimInfo::__WorldContext' has a wrong offset!");

// Function TsVehicleBlueprintFunctionLibrary.TsVehicleBlueprintFunctionLibrary_C.GetAndResetEnterSprint
// 0x0018 (0x0018 - 0x0000)
struct TsVehicleBlueprintFunctionLibrary_C_GetAndResetEnterSprint final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TsVehicleBlueprintFunctionLibrary_C_GetAndResetEnterSprint) == 0x000008, "Wrong alignment on TsVehicleBlueprintFunctionLibrary_C_GetAndResetEnterSprint");
static_assert(sizeof(TsVehicleBlueprintFunctionLibrary_C_GetAndResetEnterSprint) == 0x000018, "Wrong size on TsVehicleBlueprintFunctionLibrary_C_GetAndResetEnterSprint");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_GetAndResetEnterSprint, EntityId) == 0x000000, "Member 'TsVehicleBlueprintFunctionLibrary_C_GetAndResetEnterSprint::EntityId' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_GetAndResetEnterSprint, __WorldContext) == 0x000008, "Member 'TsVehicleBlueprintFunctionLibrary_C_GetAndResetEnterSprint::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_GetAndResetEnterSprint, ReturnValue) == 0x000010, "Member 'TsVehicleBlueprintFunctionLibrary_C_GetAndResetEnterSprint::ReturnValue' has a wrong offset!");

// Function TsVehicleBlueprintFunctionLibrary.TsVehicleBlueprintFunctionLibrary_C.UpdateDrivedVehiclePerformData
// 0x0018 (0x0018 - 0x0000)
struct TsVehicleBlueprintFunctionLibrary_C_UpdateDrivedVehiclePerformData final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsImpacted;                                        // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Direction;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Strength;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsVehicleBlueprintFunctionLibrary_C_UpdateDrivedVehiclePerformData) == 0x000008, "Wrong alignment on TsVehicleBlueprintFunctionLibrary_C_UpdateDrivedVehiclePerformData");
static_assert(sizeof(TsVehicleBlueprintFunctionLibrary_C_UpdateDrivedVehiclePerformData) == 0x000018, "Wrong size on TsVehicleBlueprintFunctionLibrary_C_UpdateDrivedVehiclePerformData");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_UpdateDrivedVehiclePerformData, EntityId) == 0x000000, "Member 'TsVehicleBlueprintFunctionLibrary_C_UpdateDrivedVehiclePerformData::EntityId' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_UpdateDrivedVehiclePerformData, IsImpacted) == 0x000004, "Member 'TsVehicleBlueprintFunctionLibrary_C_UpdateDrivedVehiclePerformData::IsImpacted' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_UpdateDrivedVehiclePerformData, Direction) == 0x000008, "Member 'TsVehicleBlueprintFunctionLibrary_C_UpdateDrivedVehiclePerformData::Direction' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_UpdateDrivedVehiclePerformData, Strength) == 0x00000C, "Member 'TsVehicleBlueprintFunctionLibrary_C_UpdateDrivedVehiclePerformData::Strength' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_UpdateDrivedVehiclePerformData, __WorldContext) == 0x000010, "Member 'TsVehicleBlueprintFunctionLibrary_C_UpdateDrivedVehiclePerformData::__WorldContext' has a wrong offset!");

// Function TsVehicleBlueprintFunctionLibrary.TsVehicleBlueprintFunctionLibrary_C.GetDrivedVehicleSeatRot
// 0x0020 (0x0020 - 0x0000)
struct TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleSeatRot final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OutRot;                                            // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleSeatRot) == 0x000008, "Wrong alignment on TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleSeatRot");
static_assert(sizeof(TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleSeatRot) == 0x000020, "Wrong size on TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleSeatRot");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleSeatRot, EntityId) == 0x000000, "Member 'TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleSeatRot::EntityId' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleSeatRot, OutRot) == 0x000004, "Member 'TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleSeatRot::OutRot' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleSeatRot, __WorldContext) == 0x000010, "Member 'TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleSeatRot::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleSeatRot, ReturnValue) == 0x000018, "Member 'TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleSeatRot::ReturnValue' has a wrong offset!");

// Function TsVehicleBlueprintFunctionLibrary.TsVehicleBlueprintFunctionLibrary_C.ConvertAngleToPassengerSpace
// 0x0018 (0x0018 - 0x0000)
struct TsVehicleBlueprintFunctionLibrary_C_ConvertAngleToPassengerSpace final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         YawInVehicleCoordinate;                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsVehicleBlueprintFunctionLibrary_C_ConvertAngleToPassengerSpace) == 0x000008, "Wrong alignment on TsVehicleBlueprintFunctionLibrary_C_ConvertAngleToPassengerSpace");
static_assert(sizeof(TsVehicleBlueprintFunctionLibrary_C_ConvertAngleToPassengerSpace) == 0x000018, "Wrong size on TsVehicleBlueprintFunctionLibrary_C_ConvertAngleToPassengerSpace");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_ConvertAngleToPassengerSpace, EntityId) == 0x000000, "Member 'TsVehicleBlueprintFunctionLibrary_C_ConvertAngleToPassengerSpace::EntityId' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_ConvertAngleToPassengerSpace, YawInVehicleCoordinate) == 0x000004, "Member 'TsVehicleBlueprintFunctionLibrary_C_ConvertAngleToPassengerSpace::YawInVehicleCoordinate' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_ConvertAngleToPassengerSpace, __WorldContext) == 0x000008, "Member 'TsVehicleBlueprintFunctionLibrary_C_ConvertAngleToPassengerSpace::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_ConvertAngleToPassengerSpace, ReturnValue) == 0x000010, "Member 'TsVehicleBlueprintFunctionLibrary_C_ConvertAngleToPassengerSpace::ReturnValue' has a wrong offset!");

// Function TsVehicleBlueprintFunctionLibrary.TsVehicleBlueprintFunctionLibrary_C.GetDrivedVehicleVelocity
// 0x0020 (0x0020 - 0x0000)
struct TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleVelocity final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OutVelocity;                                       // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleVelocity) == 0x000008, "Wrong alignment on TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleVelocity");
static_assert(sizeof(TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleVelocity) == 0x000020, "Wrong size on TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleVelocity");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleVelocity, EntityId) == 0x000000, "Member 'TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleVelocity::EntityId' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleVelocity, OutVelocity) == 0x000004, "Member 'TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleVelocity::OutVelocity' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleVelocity, __WorldContext) == 0x000010, "Member 'TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleVelocity::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleVelocity, ReturnValue) == 0x000018, "Member 'TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleVelocity::ReturnValue' has a wrong offset!");

// Function TsVehicleBlueprintFunctionLibrary.TsVehicleBlueprintFunctionLibrary_C.GetDrivedVehicleRotiationSpeed
// 0x0018 (0x0018 - 0x0000)
struct TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleRotiationSpeed final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleRotiationSpeed) == 0x000008, "Wrong alignment on TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleRotiationSpeed");
static_assert(sizeof(TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleRotiationSpeed) == 0x000018, "Wrong size on TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleRotiationSpeed");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleRotiationSpeed, EntityId) == 0x000000, "Member 'TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleRotiationSpeed::EntityId' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleRotiationSpeed, __WorldContext) == 0x000008, "Member 'TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleRotiationSpeed::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleRotiationSpeed, ReturnValue) == 0x000010, "Member 'TsVehicleBlueprintFunctionLibrary_C_GetDrivedVehicleRotiationSpeed::ReturnValue' has a wrong offset!");

// Function TsVehicleBlueprintFunctionLibrary.TsVehicleBlueprintFunctionLibrary_C.GetVehicleVelocity
// 0x0020 (0x0020 - 0x0000)
struct TsVehicleBlueprintFunctionLibrary_C_GetVehicleVelocity final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OutVelocity;                                       // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TsVehicleBlueprintFunctionLibrary_C_GetVehicleVelocity) == 0x000008, "Wrong alignment on TsVehicleBlueprintFunctionLibrary_C_GetVehicleVelocity");
static_assert(sizeof(TsVehicleBlueprintFunctionLibrary_C_GetVehicleVelocity) == 0x000020, "Wrong size on TsVehicleBlueprintFunctionLibrary_C_GetVehicleVelocity");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_GetVehicleVelocity, EntityId) == 0x000000, "Member 'TsVehicleBlueprintFunctionLibrary_C_GetVehicleVelocity::EntityId' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_GetVehicleVelocity, OutVelocity) == 0x000004, "Member 'TsVehicleBlueprintFunctionLibrary_C_GetVehicleVelocity::OutVelocity' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_GetVehicleVelocity, __WorldContext) == 0x000010, "Member 'TsVehicleBlueprintFunctionLibrary_C_GetVehicleVelocity::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_GetVehicleVelocity, ReturnValue) == 0x000018, "Member 'TsVehicleBlueprintFunctionLibrary_C_GetVehicleVelocity::ReturnValue' has a wrong offset!");

// Function TsVehicleBlueprintFunctionLibrary.TsVehicleBlueprintFunctionLibrary_C.GetVehicleRotiationSpeed
// 0x0018 (0x0018 - 0x0000)
struct TsVehicleBlueprintFunctionLibrary_C_GetVehicleRotiationSpeed final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsVehicleBlueprintFunctionLibrary_C_GetVehicleRotiationSpeed) == 0x000008, "Wrong alignment on TsVehicleBlueprintFunctionLibrary_C_GetVehicleRotiationSpeed");
static_assert(sizeof(TsVehicleBlueprintFunctionLibrary_C_GetVehicleRotiationSpeed) == 0x000018, "Wrong size on TsVehicleBlueprintFunctionLibrary_C_GetVehicleRotiationSpeed");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_GetVehicleRotiationSpeed, EntityId) == 0x000000, "Member 'TsVehicleBlueprintFunctionLibrary_C_GetVehicleRotiationSpeed::EntityId' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_GetVehicleRotiationSpeed, __WorldContext) == 0x000008, "Member 'TsVehicleBlueprintFunctionLibrary_C_GetVehicleRotiationSpeed::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsVehicleBlueprintFunctionLibrary_C_GetVehicleRotiationSpeed, ReturnValue) == 0x000010, "Member 'TsVehicleBlueprintFunctionLibrary_C_GetVehicleRotiationSpeed::ReturnValue' has a wrong offset!");

}

